Revit 2027 API
ExternalServices.BuiltInExternalServices.ExternalUIService Property
 Unique service id.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ExternalUIService { get; }
Public Shared ReadOnly Property ExternalUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ExternalUIService {
	ExternalServiceId^ get ();
}
static member ExternalUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace